In [1]:
!python -V

Python 3.7.10

In [2]:
pwd

'/Users/parani/Documents/Tutorials/Machine Learning/Python'

In [3]:
import pandas as pd
import openpyxl
import xlrd

In [4]:
pd.__version__

'1.2.4'

## Create DataFrame

In [5]:
## Dataframe from a excel file
## Header starts from Row 2 in excel
df = pd.read_excel("data/suits.xlsx", sheet_name="Charactors", header=1, engine="openpyxl")

In [6]:
df.head()

   S.No    name gender   age   designation    salary  Unnamed: 6
0     1   louis      M  42.0    sr.partner  125000.0         NaN
1     2  rachal      F  24.0     paralegal    9000.0         NaN
2     3  herold      M   NaN  jr.associate   25000.0         NaN
3     4    mike      M  29.0  jr.associate   45000.0         NaN
4     5  harvey      M  41.0    sr.partner  175000.0         NaN

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   S.No         14 non-null     int64
 1   name         14 non-null     object
 2   gender       13 non-null     object
 3   age          12 non-null     float64
 4   designation  14 non-null     object
 5   salary       11 non-null     float64
 6   Unnamed: 6   0 non-null      float64
dtypes: float64(3), int64(1), object(3)
memory usage: 912.0+ bytes

In [8]:
# Read Excel file with dtype
# Choosing right dtype reduces memory
pr = pd.read_excel("/Users/parani/Documents/Tutorials/Machine Learning/Python/data/pr_temp.xlsx",
                    dtype={"PR_SellerGSTIN":"category", "PR_SellerPANNo": "category", "PR_Supplier Name": "category"} )

In [9]:
pr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 94199 entries, 0 to 94198
Data columns (total 24 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   PR_SeqNo          94199 non-null  int64
 1   PR_Taxpayer       94199 non-null  object
 2   PR_FinancialYear  94199 non-null  object
 3   PR_TaxPeriod      94199 non-null  int64
 4   PR_SellerGSTIN    94199 non-null  category
 5   PR_SellerPANNo    94199 non-null  category
 6   PR_InvNo_M        94197 non-null  object
 7   PR_InvNo_O        94199 non-null  object
 8   PR_InvoiceDate    94199 non-null  datetime64[ns]
 9   PR_IGST           94199 non-null  float64
 10  PR_CGST           94199 non-null  float64
 11  PR_SGST           94199 non-null  float64
 12  PR_TGST           94199 non-null  float64
 13  PR_RecordType     94199 non-null  object
 14  PR_EligibleITC    94199 non-null  object
 15  PR_InterCompany   94199 non-null  object
 16  PR_RCM            0 non-null      float64
 17  PR_Reasons        0 non-null      float64
 18  PR_Supplier Name  94199 non-null  category
 19  B1                0 non-null      float64
 20  Record Type       20507 non-null  object
 21  TaxableValue      94199 non-null  float64
 22  B3                0 non-null      float64
 23  a                 0 non-null      float64
dtypes: category(3), datetime64[ns](1), float64(10), int64(2), object(8)
memory usage: 15.7+ MB

In [10]:
## Dataframe from a CSV file
df = pd.read_csv("data/salaries.csv", header=0)

In [11]:
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

### Arithmaric Operations

In [12]:
df["Salary"].max()

83000.0

In [13]:
df["Age"].min()

27.0

In [14]:
df["Country"].mode()

0    France
dtype: object

In [15]:
df["Age"].median()

38.0

In [16]:
df["Salary"].mean()

63777.77777777778

In [17]:
df[df.Salary > df.Salary.mean()]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

### Convert DataFrame to Numpy Array
> __IMPORTANT :__ df.as_matrix() was depriciated after the version 0.23.0 use df.values

In [18]:
df.values

array([['France', 44.0, 72000.0, 'No'],
       ['Spain', 27.0, 48000.0, 'Yes'],
       ['Germany', 30.0, 54000.0, 'No'],
       ['Spain', 38.0, 61000.0, 'No'],
       ['Germany', 40.0, nan, 'Yes'],
       ['France', 35.0, 58000.0, 'Yes'],
       ['Spain', nan, 52000.0, 'No'],
       ['France', 48.0, 79000.0, 'Yes'],
       ['Germany', 50.0, 83000.0, 'No'],
       ['France', 37.0, 67000.0, 'Yes']], dtype=object)

In [19]:
print(df.values.shape)
print(df.values.dtype)

(10, 4)
object

### Write to file

In [20]:
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [21]:
# Write to CSV
df.to_csv("data/sample_salaries.csv", index=False)

In [22]:
# Write to Excel
df.to_excel("data/sample_salaries.xlsx", sheet_name="Salaries", index=False)

In [23]:
# Read and Write to SQL Query or Database Table
engine = create_engine('sqlite:///:memory:')
pd.read_sql(SELECT * FROM my_table;, engine)
pd.read_sql_table('my_table', engine)
pd.read_sql_query(SELECT * FROM my_table;', engine)

SyntaxError: invalid syntax (<ipython-input-23-9c53cd4d0aa9>, line 3)

In [ ]:
df.to_sql('myDf', engine)

## Selection

In [24]:
## Dataframe from a CSV file
df = pd.read_csv("data/salaries.csv", header=0)

In [25]:
df['Age'].head()

0    44.0
1    27.0
2    30.0
3    38.0
4    40.0
Name: Age, dtype: float64

In [26]:
df[["Age", "Purchased"]].head(10)

    Age Purchased
0  44.0        No
1  27.0       Yes
2  30.0        No
3  38.0        No
4  40.0       Yes
5  35.0       Yes
6   NaN        No
7  48.0       Yes
8  50.0        No
9  37.0       Yes

In [27]:
# Get result based on rows
df[1:3]

   Country   Age   Salary Purchased
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [28]:
# First 3 rows all cols
df[:3]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

### Select using Labels

In [29]:
df.loc[:2]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [30]:
# Select using Labels
# First 4 rows
cols = ["Age", "Purchased"]
df2 = df.loc[:3,cols]

In [31]:
df2

    Age Purchased
0  44.0        No
1  27.0       Yes
2  30.0        No
3  38.0        No

### Select using Index

In [32]:
# df[row_index , Col_inex]

In [33]:
# First 3 rows
df.iloc[:3]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [34]:
# All rows first 3 columns
df.iloc[:,:3]

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0      NaN
5   France  35.0  58000.0
6    Spain   NaN  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0
9   France  37.0  67000.0

### Select using masks

In [35]:
df[df.Salary > df.Salary.mean()]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [36]:
df[(df.Salary > df.Salary.mean()) & (df.Age > 45)]

   Country   Age   Salary Purchased
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No

## Dropping

In [37]:
# Drop rows based on index
df.drop([0,1,5,9])

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No

In [38]:
df.drop(df[(df.Salary > df.Salary.mean()) & (df.Age > 45)].index, inplace=True)

In [39]:
# Drop based on Column
df.drop(["Age", "Salary"], axis=1)

   Country Purchased
0   France        No
1    Spain       Yes
2  Germany        No
3    Spain        No
4  Germany       Yes
5   France       Yes
6    Spain        No
9   France       Yes

In [40]:
# Drop null rows
df.dropna()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
9   France  37.0  67000.0       Yes

In [41]:
# Drop null rows
df.dropna(subset=["Age"])

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
9   France  37.0  67000.0       Yes

In [42]:
# Drop null columns
df.dropna(axis=1)

   Country Purchased
0   France        No
1    Spain       Yes
2  Germany        No
3    Spain        No
4  Germany       Yes
5   France       Yes
6    Spain        No
9   France       Yes

## Sort

In [43]:
df.sort_values(by=["Country", "Age"])

   Country   Age   Salary Purchased
5   France  35.0  58000.0       Yes
9   France  37.0  67000.0       Yes
0   France  44.0  72000.0        No
2  Germany  30.0  54000.0        No
4  Germany  40.0      NaN       Yes
1    Spain  27.0  48000.0       Yes
3    Spain  38.0  61000.0        No
6    Spain   NaN  52000.0        No

In [53]:
df.sort_values(by=["Age"], ascending=False)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
4  Germany  40.0      NaN       Yes
3    Spain  38.0  61000.0        No
9   France  37.0  67000.0       Yes
5   France  35.0  58000.0       Yes
2  Germany  30.0  54000.0        No
1    Spain  27.0  48000.0       Yes
6    Spain   NaN  52000.0        No

## Dataframe Info

In [44]:
df.shape

(8, 4)

In [45]:
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 9], dtype='int64')

In [46]:
df.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    8 non-null      object
 1   Age        7 non-null      float64
 2   Salary     7 non-null      float64
 3   Purchased  8 non-null      object
dtypes: float64(2), object(2)
memory usage: 320.0+ bytes

In [49]:
df.describe()

             Age        Salary
count   7.000000      7.000000
mean   35.857143  58857.142857
std     5.814596   8493.695141
min    27.000000  48000.000000
25%    32.500000  53000.000000
50%    37.000000  58000.000000
75%    39.000000  64000.000000
max    44.000000  72000.000000

## Summmary

In [50]:
df.Salary.sum()

412000.0

In [52]:
df.Salary.cumsum()

0     72000.0
1    120000.0
2    174000.0
3    235000.0
4         NaN
5    293000.0
6    345000.0
9    412000.0
Name: Salary, dtype: float64

## Apply Functions

In [ ]:
f = lambda x: x